MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/M451MSD3AE/mcu.h
#define USBD_ATTR_RESUME_Pos             (2)                                               /*!< USBD_T::ATTR: RESUME Position             */
#define USBD_ATTR_RESUME_Msk             (0x1ul << USBD_ATTR_RESUME_Pos)                   /*!< USBD_T::ATTR: RESUME Mask                 */

#define USBD_ATTR_TOUT_Pos               (3)                                               /*!< USBD_T::ATTR: TOUT Position               */
#define USBD_ATTR_TOUT_Msk               (0x1ul << USBD_ATTR_TOUT_Pos)                     /*!< USBD_T::ATTR: TOUT Mask                   */

#define USBD_ATTR_PHYEN_Pos              (4)                                               /*!< USBD_T::ATTR: PHYEN Position              */
#define USBD_ATTR_PHYEN_Msk              (0x1ul << USBD_ATTR_PHYEN_Pos)                    /*!< USBD_T::ATTR: PHYEN Mask                  */

#define USBD_ATTR_RWAKEUP_Pos            (5)                                               /*!< USBD_T::ATTR: RWAKEUP Position            */
#define USBD_ATTR_RWAKEUP_Msk            (0x1ul << USBD_ATTR_RWAKEUP_Pos)                  /*!< USBD_T::ATTR: RWAKEUP Mask                */

#define USBD_ATTR_USBEN_Pos              (7)                                               /*!< USBD_T::ATTR: USBEN Position              */
#define USBD_ATTR_USBEN_Msk              (0x1ul << USBD_ATTR_USBEN_Pos)                    /*!< USBD_T::ATTR: USBEN Mask                  */

#define USBD_ATTR_DPPUEN_Pos             (8)                                               /*!< USBD_T::ATTR: DPPUEN Position             */
#define USBD_ATTR_DPPUEN_Msk             (0x1ul << USBD_ATTR_DPPUEN_Pos)                   /*!< USBD_T::ATTR: DPPUEN Mask                 */

#define USBD_ATTR_PWRDN_Pos              (9)                                               /*!< USBD_T::ATTR: PWRDN Position              */
#define USBD_ATTR_PWRDN_Msk              (0x1ul << USBD_ATTR_PWRDN_Pos)                    /*!< USBD_T::ATTR: PWRDN Mask                  */

#define USBD_ATTR_BYTEM_Pos              (10)                                              /*!< USBD_T::ATTR: BYTEM Position              */
#define USBD_ATTR_BYTEM_Msk              (0x1ul << USBD_ATTR_BYTEM_Pos)                    /*!< USBD_T::ATTR: BYTEM Mask                  */

#define USBD_VBUSDET_VBUSDET_Pos         (0)                                               /*!< USBD_T::VBUSDET: VBUSDET Position         */
#define USBD_VBUSDET_VBUSDET_Msk         (0x1ul << USBD_VBUSDET_VBUSDET_Pos)               /*!< USBD_T::VBUSDET: VBUSDET Mask             */

#define USBD_STBUFSEG_STBUFSEG_Pos       (3)                                               /*!< USBD_T::STBUFSEG: STBUFSEG Position       */
#define USBD_STBUFSEG_STBUFSEG_Msk       (0x3ful << USBD_STBUFSEG_STBUFSEG_Pos)            /*!< USBD_T::STBUFSEG: STBUFSEG Mask           */

#define USBD_SE0_SE0_Pos                 (0)                                               /*!< USBD_T::SE0: SE0 Position                 */
#define USBD_SE0_SE0_Msk                 (0x1ul << USBD_SE0_SE0_Pos)                       /*!< USBD_T::SE0: SE0 Mask                     */

#define USBD_BUFSEG_BUFSEG_Pos           (3)                                               /*!< USBD_EP_T::BUFSEG: BUFSEG Position          */
#define USBD_BUFSEG_BUFSEG_Msk           (0x3ful << USBD_BUFSEG_BUFSEG_Pos)                /*!< USBD_EP_T::BUFSEG: BUFSEG Mask              */

#define USBD_MXPLD_MXPLD_Pos             (0)                                               /*!< USBD_EP_T::MXPLD: MXPLD Position            */
#define USBD_MXPLD_MXPLD_Msk             (0x1fful << USBD_MXPLD_MXPLD_Pos)                 /*!< USBD_EP_T::MXPLD: MXPLD Mask                */

#define USBD_CFG_EPNUM_Pos               (0)                                               /*!< USBD_EP_T::CFG: EPNUM Position              */
#define USBD_CFG_EPNUM_Msk               (0xful << USBD_CFG_EPNUM_Pos)                     /*!< USBD_EP_T::CFG: EPNUM Mask                  */

#define USBD_CFG_ISOCH_Pos               (4)                                               /*!< USBD_EP_T::CFG: ISOCH Position              */
#define USBD_CFG_ISOCH_Msk               (0x1ul << USBD_CFG_ISOCH_Pos)                     /*!< USBD_EP_T::CFG: ISOCH Mask                  */

#define USBD_CFG_STATE_Pos               (5)                                               /*!< USBD_EP_T::CFG: STATE Position              */
#define USBD_CFG_STATE_Msk               (0x3ul << USBD_CFG_STATE_Pos)                     /*!< USBD_EP_T::CFG: STATE Mask                  */

#define USBD_CFG_DSQSYNC_Pos             (7)                                               /*!< USBD_EP_T::CFG: DSQSYNC Position            */
#define USBD_CFG_DSQSYNC_Msk             (0x1ul << USBD_CFG_DSQSYNC_Pos)                   /*!< USBD_EP_T::CFG: DSQSYNC Mask                */

#define USBD_CFG_CSTALL_Pos              (9)                                               /*!< USBD_EP_T::CFG: CSTALL Position             */
#define USBD_CFG_CSTALL_Msk              (0x1ul << USBD_CFG_CSTALL_Pos)                    /*!< USBD_EP_T::CFG: CSTALL Mask                 */

#define USBD_CFGP_CLRRDY_Pos             (0)                                               /*!< USBD_EP_T::CFGP: CLRRDY Position            */
#define USBD_CFGP_CLRRDY_Msk             (0x1ul << USBD_CFGP_CLRRDY_Pos)                   /*!< USBD_EP_T::CFGP: CLRRDY Mask                */

#define USBD_CFGP_SSTALL_Pos             (1)                                               /*!< USBD_EP_T::CFGP: SSTALL Position            */
#define USBD_CFGP_SSTALL_Msk             (0x1ul << USBD_CFGP_SSTALL_Pos)                   /*!< USBD_EP_T::CFGP: SSTALL Mask                */

/**@}*/ /* USB_CONST */
/**@}*/ /* end of USB register group */


/*---------------------- USB Host Controller -------------------------*/
/**
    @addtogroup USBH USB Host Controller(USBH)
    Memory Mapped Structure for USBH Controller
@{ */


typedef struct
{




/**
 * @var USBH_T::HcRevision
 * Offset: 0x00  Host Controller Revision Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |REV       |Revision Number
 * |        |          |Indicates the Open HCI Specification revision number implemented by the Hardware.
 * |        |          |Host Controller supports 1.1 specification.
 * |        |          |(X.Y = XYh).
 * @var USBH_T::HcControl
 * Offset: 0x04  Host Controller Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[1:0]   |CBSR      |Control Bulk Service Ratio
 * |        |          |This specifies the service ratio between Control and Bulk EDs.
 * |        |          |Before processing any of the non-periodic lists, HC must compare the ratio specified with its internal count on how many nonempty Control EDs have been processed, in determining whether to continue serving another Control ED or switching to Bulk EDs.
 * |        |          |The internal count will be retained when crossing the frame boundary.
 * |        |          |In case of reset, HCD is responsible for restoring this.
 * |        |          |Value.
 * |        |          |00 = Number of Control EDs over Bulk EDs served is 1:1.
 * |        |          |01 = Number of Control EDs over Bulk EDs served is 2:1.
 * |        |          |10 = Number of Control EDs over Bulk EDs served is 3:1.
 * |        |          |11 = Number of Control EDs over Bulk EDs served is 4:1.
 * |[2]     |PLE       |Periodic List Enable Bit
 * |        |          |When set, this bit enables processing of the Periodic (interrupt and Isochronous) list.
 * |        |          |The Host Controller checks this bit prior to attempting any periodic transfers in a frame.
 * |        |          |0 = Disable the processing of the Periodic (Interrupt and Isochronous) list after next SOF (Start-Of-Frame).
 * |        |          |1 = Enable the processing of the Periodic (Interrupt and Isochronous) list in the next frame.
 * |        |          |Note: To enable the processing of the Isochronous list, user has to set both PLE and IE (HcControl[3]) high.
 * |[3]     |IE        |Isochronous List Enable Bit
 * |        |          |Both ISOEn and PLE (HcControl[2]) high enables Host Controller to process the Isochronous list.
 * |        |          |Either ISOEn or PLE (HcControl[2]) is low disables Host Controller to process the Isochronous list.
 * |        |          |0 = Disable the processing of the Isochronous list after next SOF (Start-Of-Frame).
 * |        |          |1 = Enable the processing of the Isochronous list in the next frame if the PLE (HcControl[2]) is high, too.
 * |[4]     |CLE       |Control List Enable Bit
 * |        |          |0 = Disable processing of the Control list after next SOF (Start-Of-Frame).
 * |        |          |1 = Enable processing of the Control list in the next frame.
 * |[5]     |BLE       |Bulk List Enable Bit
 * |        |          |0 = Disable processing of the Bulk list after next SOF (Start-Of-Frame).
 * |        |          |1 = Enable processing of the Bulk list in the next frame.
 * |[7:6]   |HCFS      |Host Controller Functional State
 * |        |          |This field sets the Host Controller state.
 * |        |          |The Controller may force a state change from USBSUSPEND to USBRESUME after detecting resume signaling from a downstream port.
 * |        |          |States are:
 * |        |          |00 = USBSUSPEND.
 * |        |          |01 = USBRESUME.
 * |        |          |10 = USBOPERATIONAL.
 * |        |          |11 = USBRESET.
 * @var USBH_T::HcCommandStatus
 * Offset: 0x08  Host Controller CMD Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |HCR       |Host Controller Reset
 * |        |          |This bit is set to initiate the software reset of Host Controller.
 * |        |          |This bit is cleared by the Host Controller, upon completed of the reset operation.
 * |        |          |This bit, when set, didn't reset the Root Hub and no subsequent reset signaling be asserted to its downstream ports.
 * |        |          |0 = Host Controller is not in software reset state.
 * |        |          |1 = Host Controller is in software reset state.
 * |[1]     |CLF       |Control List Filled
 * |        |          |Set high to indicate there is an active TD on the Control List.
 * |        |          |It may be set by either software or the Host Controller and cleared by the Host Controller each time it begins processing the head of the Control List.
 * |        |          |0 = No active TD found or Host Controller begins to process the head of the Control list.
 * |        |          |1 = An active TD added or found on the Control list.
 * |[2]     |BLF       |Bulk List Filled
 * |        |          |Set high to indicate there is an active TD on the Bulk list.
 * |        |          |This bit may be set by either software or the Host Controller and cleared by the Host Controller each time it begins processing the head of the Bulk list.
 * |        |          |0 = No active TD found or Host Controller begins to process the head of the Bulk list.
 * |        |          |1 = An active TD added or found on the Bulk list.
 * |[17:16] |SOC       |Schedule Overrun Count
 * |        |          |These bits are incremented on each scheduling overrun error.
 * |        |          |It is initialized to 00b and wraps around at 11b.
 * |        |          |This will be incremented when a scheduling overrun is detected even if SO (HcIntSts[0]) has already been set.
 * @var USBH_T::HcInterruptStatus
 * Offset: 0x0C  Host Controller Interrupt Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |SO        |Scheduling Overrun
 * |        |          |Set when the List Processor determines a Schedule Overrun has occurred.
 * |        |          |0 = Schedule Overrun didn't occur.
 * |        |          |1 = Schedule Overrun has occurred.
 * |[1]     |WDH       |Write Back Done Head
 * |        |          |Set after the Host Controller has written HcDoneHead to HccaDoneHead.
 * |        |          |Further updates of the HccaDoneHead will not occur until this bit has been cleared.
 * |        |          |0 =.Host Controller didn't update HccaDoneHead.
 * |        |          |1 =.Host Controller has written HcDoneHead to HccaDoneHead.
 * |[2]     |SF        |Start Of Frame
 * |        |          |Set when the Frame Management functional block signals a 'Start of Frame' event.
 * |        |          |Host Control generates a SOF token at the same time.
 * |        |          |0 =.Not the start of a frame.
 * |        |          |1 =.Indicate the start of a frame and Host Controller generates a SOF token.
 * |[3]     |RD        |Resume Detected
 * |        |          |Set when Host Controller detects resume signaling on a downstream port.
 * |        |          |0 = No resume signaling detected on a downstream port.
 * |        |          |1 = Resume signaling detected on a downstream port.
 * |[5]     |FNO       |Frame Number Overflow
 * |        |          |This bit is set when bit 15 of Frame Number changes from 1 to 0 or from 0 to 1.
 * |        |          |0 = The bit 15 of Frame Number didn't change.
 * |        |          |1 = The bit 15 of Frame Number changes from 1 to 0 or from 0 to 1.
 * |[6]     |RHSC      |Root Hub Status Change
 * |        |          |This bit is set when the content of HcRhSts or the content of HcRhPrt1 register has changed.
 * |        |          |0 = The content of HcRhSts and the content of HcRhPrt1 register didn't change.
 * |        |          |1 = The content of HcRhSts or the content of HcRhPrt1 register has changed.
 * @var USBH_T::HcInterruptEnable
 * Offset: 0x10  Host Controller Interrupt Enable Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |SO        |Scheduling Overrun Enable Bit
 * |        |          |Write Operation:
 * |        |          |0 = No effect.
 * |        |          |1 = Enable interrupt generation due to SO (HcIntSts[0]).
 * |        |          |Read Operation:
 * |        |          |0 = Interrupt generation due to SO (HcIntSts[0]) disabled.
 * |        |          |1 = Interrupt generation due to SO (HcIntSts[0]) enabled.
 * |[1]     |WDH       |Write Back Done Head Enable Bit
 * |        |          |Write Operation:
 * |        |          |0 = No effect.
 * |        |          |1 = Enable interrupt generation due to WDH (HcIntSts[1]).
 * |        |          |Read Operation:
 * |        |          |0 = Interrupt generation due to WDH (HcIntSts[1]) disabled.
 * |        |          |1 = Interrupt generation due to WDH (HcIntSts[1]) enabled.
 * |[2]     |SF        |Start Of Frame Enable Bit
 * |        |          |Write Operation:
 * |        |          |0 = No effect.
 * |        |          |1 = Enable interrupt generation due to SF (HcIntSts[2]).
 * |        |          |Read Operation:
 * |        |          |0 = Interrupt generation due to SF (HcIntSts[2]) disabled.
 * |        |          |1 = Interrupt generation due to SF (HcIntSts[2]) enabled.
 * |[3]     |RD        |Resume Detected Enable Bit
 * |        |          |Write Operation:
 * |        |          |0 = No effect.
 * |        |          |1 = Enable interrupt generation due to RD (HcIntSts[3]).
 * |        |          |Read Operation:
 * |        |          |0 = Interrupt generation due to RD (HcIntSts[3]) disabled.
 * |        |          |1 = Interrupt generation due to RD (HcIntSts[3]) enabled.
 * |[5]     |FNO       |Frame Number Overflow Enable Bit
 * |        |          |Write Operation:
 * |        |          |0 = No effect.
 * |        |          |1 = Enable interrupt generation due to FNO (HcIntSts[5]).
 * |        |          |Read Operation:
 * |        |          |0 = Interrupt generation due to FNO (HcIntSts[5]) disabled.
 * |        |          |1 = Interrupt generation due to FNO (HcIntSts[5]) enabled.
 * |[6]     |RHSC      |Root Hub Status Change Enable Bit
 * |        |          |Write Operation:
 * |        |          |0 = No effect.
 * |        |          |1 = Enable interrupt generation due to RHSC (HcIntSts[6]).
 * |        |          |Read Operation:
 * |        |          |0 = Interrupt generation due to RHSC (HcIntSts[6]) disabled.
 * |        |          |1 = Interrupt generation due to RHSC (HcIntSts[6]) enabled.
 * |[31]    |MIE       |Master Interrupt Enable Bit
 * |        |          |This bit is a global interrupt enable.
 * |        |          |A write of '1' allows interrupts to be enabled via the specific enable bits listed above.
 * |        |          |Write Operation:
 * |        |          |0 = No effect.
 * |        |          |1 = Enable interrupt generation due to RHSC (HcIntSts[6]), FNO (HcIntSts[5]), RD (HcIntSts[3]), SF (HcIntSts[2]), WDH (HcIntSts[1]) or SO (HcIntSts[0]) if the corresponding bit in HcIntEn is high.
 * |        |          |Read Operation:
 * |        |          |0 = Interrupt generation due to RHSC (HcIntSts[6]), FNO (HcIntSts[5]), RD (HcIntSts[3]), SF (HcIntSts[2]), WDH (HcIntSts[1]) or SO (HcIntSts[0]) disabled even if the corresponding bit in HcIntEn is high.
 * |        |          |1 = Interrupt generation due to RHSC (HcIntSts[6]), FNO (HcIntSts[5]), RD (HcIntSts[3]), SF (HcIntSts[2]), WDH (HcIntSts[1]) or SO (HcIntSts[0]) enabled if the corresponding bit in HcIntEn is high.
 * @var USBH_T::HcInterruptDisable
 * Offset: 0x14  Host Controller Interrupt Disable Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |SO        |Scheduling Overrun Disable Bit
 * |        |          |Write Operation:
 * |        |          |0 = No effect.
 * |        |          |1 = Disable interrupt generation due to SO (HcIntSts[0]).
 * |        |          |Read Operation:
 * |        |          |0 = Interrupt generation due to SO (HcIntSts[0]) disabled.
 * |        |          |1 = Interrupt generation due to SO (HcIntSts[0]) enabled.
 * |[1]     |WDH       |Write Back Done Head Disable Bit
 * |        |          |Write Operation:
 * |        |          |0 = No effect.
 * |        |          |1 = Disable interrupt generation due to WDH (HcIntSts[1]).
 * |        |          |Read Operation:
 * |        |          |0 = Interrupt generation due to WDH (HcIntSts[1]) disabled.
 * |        |          |1 = Interrupt generation due to WDH (HcIntSts[1]) enabled.
 * |[2]     |SF        |Start Of Frame Disable Bit
 * |        |          |Write Operation:
 * |        |          |0 = No effect.
 * |        |          |1 = Disable interrupt generation due to SF (HcIntSts[2]).
 * |        |          |Read Operation:
 * |        |          |0 = Interrupt generation due to SF (HcIntSts[2]) disabled.
 * |        |          |1 = Interrupt generation due to SF (HcIntSts[2]) enabled.
 * |[3]     |RD        |Resume Detected Disable Bit
 * |        |          |Write Operation:
 * |        |          |0 = No effect.
 * |        |          |1 = Disable interrupt generation due to RD (HcIntSts[3]).
 * |        |          |Read Operation:
 * |        |          |0 = Interrupt generation due to RD (HcIntSts[3]) disabled.
 * |        |          |1 = Interrupt generation due to RD (HcIntSts[3]) enabled.
 * |[5]     |FNO       |Frame Number Overflow Disable Bit
 * |        |          |Write Operation:
 * |        |          |0 = No effect.
 * |        |          |1 = Disable interrupt generation due to FNO (HcIntSts[5]).
 * |        |          |Read Operation:
 * |        |          |0 = Interrupt generation due to FNO (HcIntSts[5]) disabled.
 * |        |          |1 = Interrupt generation due to FNO (HcIntSts[5]) enabled.
 * |[6]     |RHSC      |Root Hub Status Change Disable Bit
 * |        |          |Write Operation:
 * |        |          |0 = No effect.
 * |        |          |1 = Disable interrupt generation due to RHSC (HcIntSts[6]).
 * |        |          |Read Operation:
 * |        |          |0 = Interrupt generation due to RHSC (HcIntSts[6]) disabled.
 * |        |          |1 = Interrupt generation due to RHSC (HcIntSts[6]) enabled.
 * |[31]    |MIE       |Master Interrupt Disable Bit
 * |        |          |Global interrupt disable. Writing '1' to disable all interrupts.
 * |        |          |Write Operation:
 * |        |          |0 = No effect.
 * |        |          |1 = Disable interrupt generation due to RHSC (HcIntSts[6]), FNO (HcIntSts[5]), RD (HcIntSts[3]), SF (HcIntSts[2]), WDH (HcIntSts[1]) or SO (HcIntSts[0]) if the corresponding bit in HcIntEn is high.
 * |        |          |Read Operation:
 * |        |          |0 = Interrupt generation due to RHSC (HcIntSts[6]), FNO (HcIntSts[5]), RD (HcIntSts[3]), SF (HcIntSts[2]), WDH (HcIntSts[1]) or SO (HcIntSts[0]) disabled even if the corresponding bit in HcIntEn is high.
 * |        |          |1 = Interrupt generation due to RHSC (HcIntSts[6]), FNO (HcIntSts[5]), RD (HcIntSts[3]), SF (HcIntSts[2]), WDH (HcIntSts[1]) or SO (HcIntSts[0]) enabled if the corresponding bit in HcIntEn is high.
 * @var USBH_T::HcHCCA
 * Offset: 0x18  Host Controller Communication Area Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:8]  |HCCA      |Host Controller Communication Area
 * |        |          |Pointer to indicate base address of the Host Controller Communication Area (HCCA).
 * @var USBH_T::HcPeriodCurrentED
 * Offset: 0x1C  Host Controller Period Current ED Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:4]  |PCED      |Periodic Current ED
 * |        |          |Pointer to indicate physical address of the current Isochronous or Interrupt Endpoint Descriptor.
 * @var USBH_T::HcControlHeadED
 * Offset: 0x20  Host Controller Control Head ED Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:4]  |CHED      |Control Head ED
 * |        |          |Pointer to indicate physical address of the first Endpoint Descriptor of the Control list.
 * @var USBH_T::HcControlCurrentED
 * Offset: 0x24  Host Controller Control Current ED Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:4]  |CCED      |Control Current Head ED
 * |        |          |Pointer to indicate the physical address of the current Endpoint Descriptor of the Control list.
 * @var USBH_T::HcBulkHeadED
 * Offset: 0x28  Host Controller Bulk Head ED Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:4]  |BHED      |Bulk Head ED
 * |        |          |Pointer to indicate the physical address of the first Endpoint Descriptor of the Bulk list.
 * @var USBH_T::HcBulkCurrentED
 * Offset: 0x2C  Host Controller Bulk Current ED Register
